In [7]:
import pandas as pd
import numpy as np

In [6]:
days = pd.Series(['Monday', 'Tuesday','Wednesday','Thursday', 'Friday','Saturday','Sunday'])
print(days)

0       Monday
1      Tuesday
2    Wednesday
3     Thursday
4       Friday
5     Saturday
6       Sunday
dtype: object

In [8]:
days_list = np.array(['Monday', 'Tuesday','Wednesday','Thursday', 'Friday','Saturday','Sunday'])
numpy_days = pd.Series(days_list)
print(numpy_days)

0       Monday
1      Tuesday
2    Wednesday
3     Thursday
4       Friday
5     Saturday
6       Sunday
dtype: object

In [10]:
days1 = pd.Series(['Monday', 'Tuesday','Wednesday','Thursday', 'Friday','Saturday','Sunday'], index=['a','b','c','d','e','f','g'])
days

a       Monday
b      Tuesday
c    Wednesday
d     Thursday
e       Friday
f     Saturday
g       Sunday
dtype: object

In [11]:
days2 = pd.Series({'a':'Monday','b':'Tuesday','c':'Wednesday','d':'Thursday','e':'Friday','f':'Saturday','g':'Sunday'})
days2

a       Monday
b      Tuesday
c    Wednesday
d     Thursday
e       Friday
f     Saturday
g       Sunday
dtype: object

In [12]:
days1[0]

'Monday'

In [13]:
days2[5]

'Saturday'

In [14]:
days2[3:]

d    Thursday
e      Friday
f    Saturday
g      Sunday
dtype: object

In [15]:
days1['f']

'Saturday'

In [18]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [26]:
df_dict={'Country':['Nigeria','Ghana','Kenya','Togo'],
         'Capital':['Abuja','Accra','Nairobi','Lome'],
        'Population':[35000,10000,8500,12000],
         'Age':[80,75,70,60]
        }
df = pd.DataFrame(df_dict, index =[2,4,6,8])
df

   Country  Capital  Population  Age
2  Nigeria    Abuja       35000   80
4    Ghana    Accra       10000   75
6    Kenya  Nairobi        8500   70
8     Togo     Lome       12000   60

In [21]:
df.iloc[3]

country        Togo
Capital        Lome
Population    12000
Age              60
Name: 8, dtype: object

In [24]:
df.loc[4]

country       Ghana
Capital       Accra
Population    10000
Age              75
Name: 4, dtype: object

In [25]:
df['Capital']

2      Abuja
4      Accra
6    Nairobi
8       Lome
Name: Capital, dtype: object

In [27]:
df.at[6,'Country']

'Kenya'

In [28]:
df.iat[2,0]

'Kenya'

In [29]:
df['Population'].sum()

65500

In [30]:
df.mean()

Population    16375.00
Age              71.25
dtype: float64

In [31]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   16375.000000  71.250000
std    12499.166639   8.539126
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    11000.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000

In [33]:
df2 ={'name':['James','yemen','caro',np.nan],
     'profession':['Doctor','Artisit','Dancer','Typist'],
     'experience':[12,np.nan, 10, 8],
     'height':[np.nan,175,180,100]}
df2
new_df = pd.DataFrame(df2)
new_df

    name profession  experience  height
0  James     Doctor        12.0     NaN
1  yemen    Artisit         NaN   175.0
2   caro     Dancer        10.0   180.0
3    NaN     Typist         8.0   100.0

In [34]:
new_df.isnull()

    name  profession  experience  height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [36]:
new_df.dropna()

   name profession  experience  height
2  caro     Dancer        10.0   180.0

In [37]:
import matplotlib.pyplot as plt